const cdnUrl  = 'http://mamarada.biz';

const data = [
  {
    id: '001-RB-8436562291662',
    title: 'Гель шампунь 500 мл',
    description: 'Гель для душа и шампунь для мытья волос для детей',
    price: 654.50,
    inStock: true,
    previewUrl: `${cdnUrl}/static/001-RB-Gel-shampoo-preview.jpg`,
    itemUrl: `${cdnUrl}/static/001-RB-Gel-shampoo.jpg`,
    info: {
      ru: {
        title: 'Гель шампунь 500 мл',
        description: 'Гель для душа и шампунь для мытья волос для детей',
      },
      ua: {
        title: 'Гель шампунь 500 мл',
        description: 'Гель для душа и шампунь для мытья волос для детей',
      },
    },
    details: {
      images: [],
      title: 'Гель шампунь 500 мл',
      productLine: 'Базова лінія з календулою та пантенолом',
      description: '<p>Гель для душа и шампунь для мытья волос для детей. Специальная формула шампуня была разработана, чтобы его можно было использовать даже при чувствительной или раздраженной коже ребенка. Очищает, увлажняет, смягчает и успокаивает нежную кожу головы малыша, восстанавливая естественный баланс. Формула средства обогащена календулой, пантенолом и алоэ вера с заживляющим и антибактериальным действием для мягкого ухода за кожей. Ph 5.5.</p><h3>Применение:</h3><p>нанести на влажную кожу и волосы, мягко помассировать и вспенить, затем смыть теплой водой.</p><h3>Главные ингредиенты:</h3><p>Календула, Пантенол, Термальная вода, Алоэ вера, Глицерин, Аллантоин</p><h3>Не содержит: </h3><p>Парабены, Красители, Соль, Минеральное масло, Фталаты</p>',
    },
  },
  {
    id: '002-RB-8436562291679',
    title: 'Гель для ванни, що піниться 300 мл',
    description: 'Детский пенящийся гель для принятия ванны',
    price: 433.50,
    inStock: true,
    previewUrl: `${cdnUrl}/static/002-RB-Foam-bath-gel-preview.jpg`,
    itemUrl: `${cdnUrl}/static/002-RB-Foam-bath-gel.jpg`,
    details: {
      images: [],
      title: 'Гель для ванни, що піниться 300 мл',
      productLine: 'Базова лінія з календулою та пантенолом',
      description: '<p>Пенящийся гель для принятия ванны для детей. Очень мягкий пенящийся гель для принятия ванны обогащен пантенолом и календулой, компонентами, помогающими защитить, смягчить и поддержать натуральный баланс нежной кожи малыша. День за днем детская кожа чистая и защищенная. Ph 5.5.</p><h3>Применение:</h3><p>Нанести на влажную кожу, слегка помассировать и вспенить, затем смыть теплой водой.</p><h3>Главные ингредиенты:</h3><p>Календула, Пантенол, Термальная вода, Глицерин, Аллантоин</p><h3>Не содержит:</h3><p>Парабены, Красители, Соль, Минеральное масло, Фталаты</p>',
    },
  },
  {
    id: '003-RB-8436562291686',
    title: 'Сіндет гель шампунь 200 мл',
    description: 'Специальный шампунь для новорожденных без сульфатов и без аромата',
    price: 314.50,
    inStock: true,
    previewUrl: `${cdnUrl}/static/003-RB-Syndet-gel-shampoo-preview.jpg`,
    itemUrl: `${cdnUrl}/static/003-RB-Syndet-gel-shampoo.jpg`,
    details: {
      images: [],
      title: 'Сіндет гель шампунь 200 мл',
      productLine: 'Базова лінія з календулою та пантенолом',
      description: '<p>Синдет гель шампунь для детей. Специальный шампунь для новорожденных без сульфатов и без аромата, обогащенный пантенолом и календулой, которые увлажняют, смягчают и защищают кожу ребенка. Синдет гель шампунь одновременно очищает и питает, поддерживает баланс ph кожи головы. Не раздражает кожу и не щиплет глазки. Ph 5.5.</p><h3>Применение:</h3><p>нанести на влажную кожу и волосы, легко помассировать и вспенить, затем смыть теплой водой.</p><h3>Главные ингредиенты:</h3><p>Календула, Пантенол, Глицерин, Термальная вода</p><h3>Не содержит:</h3><p>Парабены, Красители, Соль, Минеральное масло, Фталаты, Ароматизаторы, Сульфаты, Феноксиэтанол</p>',
    },
  },
  {
    id: '004-RB-8436562291693',
    title: 'Натуральний шампунь Сіндет, що піниться 150',
    description: 'Пенящийся шампунь синдет с удобным пенообразователем помогает создавать невесомую пенку для нежного мытья головы',
    price: 416.50,
    inStock: true,
    previewUrl: `${cdnUrl}/static/004-RB-Foam-shampoo-syndet-preview.jpg`,
    itemUrl: `${cdnUrl}/static/004-RB-Foam-shampoo-syndet.jpg`,
    details: {
      images: [],
      title: 'Натуральний шампунь Сіндет, що піниться 150',
      productLine: 'Базова лінія з календулою та пантенолом',
      description: '<p>Пенящийся шампунь синдет для детей. Упаковка шампуня с удобным пенообразователем помогает создавать невесомую пенку для нежного мытья головы. Подходит для новорожденных. Формула содержит калундулу и пантенол для восстановления кожи и мягкого ухода за волосами. Очищение кожи головы и питание волос. Не щиплет глазки.</p><h3>Применение:</h3><p>нанести на влажную кожу головы и волосы, мягко помассировать и вспенить, затем смыть теплой водой.</p><h3>Главные ингредиенты:</h3><p>Календула, Пантенол, Глицерин, Термальная вода</p><h3>Не содержит:</h3><p>Парабены, Красители, Соль, Сульфаты, Феноксиэтанол, Фталаты, Минеральное масло</p>',
    },
  },
  {
    id: '006-RB-8436562291716',
    title: 'Натуральний лосьон для тіла 300 мл',
    description: 'Увлажняющий лосьон для тела с нежной текстурой для легкого нанесения на детскую кожу',
    price: 416.50,
    inStock: true,
    previewUrl: `${cdnUrl}/static/006-RB-Body-lotion-preview.jpg`,
    itemUrl: `${cdnUrl}/static/006-RB-Body-lotion.jpg`,
    details: {
      images: [],
      title: 'Натуральний лосьон для тіла 300 мл',
      productLine: 'Базова лінія з календулою та пантенолом',
      description: '<p>Увлажняющий лосьон для тела с нежной текстурой для легкого нанесения на детскую кожу. Формула обогащена миндальным маслом, восстанавливающим защитный барьер кожи и увлажняющим ее. Также в составе календула, пантенол, алоэ вера и масло ши для обеспечения комплексного ухода за кожей, предотвращения воспалений и раздражений. Термальная вода успокаивает чувствительную кожу малыша, оставляя кожу гладкой и защищенной. Ph нейтральный.</p><h3>Применение:</h3><p>нанести на чистую сухую кожу после купания, распределить легкими массажными движениями.</p><h3>Главные ингредиенты</h3><p>Календула, Пантенол, Термальная вода, Глицерин, Миндальное масло</p><h3>Не содержит</h3><p>Парабены, Красители, Соль, Минеральное масло, Фталаты</p>',
    },
  },
  {
    id: '011-RB-8436562291761',
    title: 'Вечірній засіб для ванни (натуральний) 200 мл',
    description: 'Мягкий пенящийся гель для ванны с приятный ароматом, специально разработанный для чувствительной кожи',
    price: 331.50,
    inStock: true,
    previewUrl: `${cdnUrl}/static/011-RB-Good-night-bath-gel-preview.jpg`,
    itemUrl: `${cdnUrl}/static/011-RB-Good-night-bath-gel.jpg`,
    details: {
      images: [],
      title: 'Вечірній засіб для ванни (натуральний) 200 мл',
      productLine: 'Вечірня лінія з лавандою та ромашкою',
      description: '<p>Мягкий пенящийся гель для ванны с приятный ароматом, специально разработанный для чувствительной кожи. Очищает, увлажняет, смягчает и успокаивает нежную кожу, восстанавливая ее природный баланс. Лаванда и ромашка, натуральные ингредиенты в формуле средства, обеспечивают успокаивающее действие. Идеально подходит для использования перед сном. Ph 5.5.</p><h3>Применение:</h3><p>нанести на влажную кожу, слегка помассировать и вспенить, затем смыть теплой водой.</p><h3>Главные ингредиенты:</h3><p>Лаванда, Ромашка, Термальная вода, Глицерин, Аллантоин</p><h3>Не содержит:</h3><p>Парабены, Красители, Соль, Минеральное масло, Фталаты</p>',
    },
  },
  {
    id: '012-RB-8436562291778',
    title: 'Вечірній лосьон для тіла (натуральний) 200 мл',
    description: 'Мягкий лосьон с легкой текстурой легко наносится и увлажняет кожу',
    price: 357.00,
    inStock: true,
    previewUrl: `${cdnUrl}/static/012-RB-Good-night-lotion-preview.jpg`,
    itemUrl: `${cdnUrl}/static/012-RB-Good-night-lotion.jpg`,
    details: {
      images: [],
      title: 'Вечірній лосьон для тіла (натуральний) 200 мл',
      productLine: 'Вечірня лінія з лавандою та ромашкою',
      description: '<p>Мягкий лосьон с легкой текстурой легко наносится и увлажняет кожу. Миндальное масло в формуле лосьона восстанавливает естественный защитный барьер кожи и поддерживает увлажненность. Ромашка и лаванда обеспечивают успокаивающее и противовоспалительное действие. Термальная вода успокаивает кожу и снимает раздражения, а нежный аромат лосьона облегчает засыпание малыша. Гипоаллергенно. Ph нейтральный.</p><h3>Применение:</h3><p>нанести на чистую сухую кожу после купания, распределить легкими массажными движениями.</p><h3>Главные ингредиенты:</h3><p>Лаванда, Ромашка, Термальная вода, Глицерин, Масло подсолнечника, Миндальное масло</p><h3>Не содержит:</h3><p>Парабены, Красители, Соль, Минеральное масло, Фталаты</p>',
    },
  },
  {
    id: '013-RB-8436562291785',
    title: 'Вечірня олія (натуральна) 100 мл',
    description: 'Шелковистое массажное масло с легкой текстурой. Обогащено миндальным маслом, содержит лаванду и ромашку',
    price: 331.50,
    inStock: true,
    previewUrl: `${cdnUrl}/static/013-RB-Good-night-oil-preview.jpg`,
    itemUrl: `${cdnUrl}/static/013-RB-Good-night-oil.jpg`,
    details: {
      images: [],
      title: 'Вечірня олія (натуральна) 100 мл',
      productLine: 'Вечірня лінія з лавандою та ромашкою',
      description: '<p>Шелковистое массажное масло с легкой текстурой для удобного нанесения. Обогащено миндальным маслом, содержит лаванду и ромашку. Помогает защитить, расслабить и смягчить кожу малыша. Подходит для новорожденных, а также для всей семьи.</p><h3>Применение:</h3><p>нанести на чистую кожу, распределить. Можно использовать для легкого массажа.</p><h3>Главные ингредиенты:</h3><p>Лаванда, Ромашка, Масло подсолнечника, Миндальное масло, Витамин Е</p><h3>Не содержит:</h3><p>Парабены, Красители, Соль, Феноксиэтанол, Фталаты</p>',
    },
  },
  {
    id: '015-RB-8436562291808',
    title: 'Засіб для ванни з медом (натуральний) 200 мл',
    description: 'Мягкий пенящийся гель для принятия ванны с алоэ вера и медом',
    price: 365.50,
    inStock: true,
    previewUrl: `${cdnUrl}/static/015-RB-Honey-bath-gel-preview.jpg`,
    itemUrl: `${cdnUrl}/static/015-RB-Honey-bath-gel.jpg`,
    details: {
      images: [],
      title: 'Засіб для ванни з медом (натуральний) 200 мл',
      productLine: 'Лінія з медом та олією ши',
      description: '<p>Мягкий пенящийся гель для принятия ванны с алоэ вера и медом помогает мягко очистить кожу, защитить и поддержать ее натуральный баланс. Восстанавливает кожу и помогает укрепить естественные защитные механизмы благодаря меду и мягким ухаживающим компонентам в составе. Ph 5.5.</p><h3>Применение:</h3><p>нанести на влажную кожу, слегка помассировать и вспенить, затем смыть теплой водой.</p><h3>Главные ингредиенты:</h3><p>Мед, Алоэ вера, Термальная вода, Глицерин</p><h3>Не содержит:</h3><p>Парабены, Красители, Соль, Минеральное масло, Фталаты</p>',
    },
  },
  {
    id: '016-RB-8436562291815',
    title: 'Лосьон для тіла з медом (натуральний) 200 мл',
    description: 'Обогащенный маслом ши и медом лосьон для нежной детской кожи',
    price: 450.50,
    inStock: true,
    previewUrl: `${cdnUrl}/static/016-RB-Honey-body-lotion-preview.jpg`,
    itemUrl: `${cdnUrl}/static/016-RB-Honey-body-lotion.jpg`,
    details: {
      images: [],
      title: 'Лосьон для тіла з медом (натуральний) 200 мл',
      productLine: 'Лінія з медом та олією ши',
      description: '<p>Обогащенный маслом ши и медом лосьон для нежной детской кожи. Мягко увлажняет и питает кожу, помогает смягчить и защитить ее, поддерживает природный баланс. Ph нейтральный.</p><h3>Применение:</h3><p>нанести на чистую сухую кожу после купания, распределить легкими массажными движениями.</p><h3>Главные ингредиенты:</h3><p>Мед, Масло ши, Термальная вода, Миндальное масло, Глицерин, Алоэ вера</p><h3>Не содержит:</h3><p>Парабены, Красители, Фталаты, Минеральное масло, Соль</p>',
    },
  },
  {
    id: '017-RB-8436562291822',
    title: 'Олія з медом (натуральна) 100 мл',
    description: 'Массажное масло с невесомой текстурой, обогащенное маслом ши и медом',
    price: 416.50,
    inStock: true,
    previewUrl: `${cdnUrl}/static/017-RB-Honey-oil-preview.jpg`,
    itemUrl: `${cdnUrl}/static/017-RB-Honey-oil.jpg`,
    details: {
      images: [],
      title: 'Олія з медом (натуральна) 100 мл',
      productLine: 'Лінія з медом та олією ши',
      description: '<p>Массажное масло с невесомой текстурой, обогащенное маслом ши и медом. Смягчает и поддерживает природный баланс кожи, препятствует потере влаги и сухости кожи. Нежная детская кожа увлажнена и защищена день за днем. Подходит для новорожденных.</p><h3>Применение:</h3><p>нанести на чистую кожу, распределить. Можно использовать для легкого массажа.</p><h3>Главные ингредиенты:</h3><p>Мед, Масло ши, Миндальное масло, Масло подсолнечника, Витамин Е, Розмарин</p><h3>Не содержит:</h3><p>Парабены, Красители, Феноксиэтанол, Фталаты, Соль</p>\n',
    },
  }
];

export default class Cosmetics {
  getListData() {
    return {
      data
    }
  }
  getItemData(id) {
    const item = data.find(item => item.id === id);

    return {
      data: item
    }
  }
}
